package hillel.lesson3;

public class Start {
    public static void main(String[] args) {
        // какой тип данных возвращает этот метод? а для чего нам методы
        //Какие типы данных принимает метод
        //Важно понимать различие между двумя терминами - параметр и аргумент. Параметр - это переменная, определенная методом,
        // которая получает значение при вызове метода. Например, в методе square ( ) параметром является i. Аргумент - это значение,
        // которое передается методу при его вызове.

        // методы бывают скольких видов?
        int  a = 13;
        int  b = 4;

        System.out.println((double) a / b);
    }

    public static double sum(int a, boolean b) {
        int x = 5;
        return x;
    }

    // рассказать про перегрузку методов
    // вчем суть ООП?

}
